rsx-electrical/STM32-ethernet/rsx_ethernet/demo/st/nucleo_f767zi/web_socket_client_demo/src/main.c
/**
 * @file main.c
 * @brief Main routine
 *
 * @section License
 *
 * SPDX-License-Identifier: GPL-2.0-or-later
 *
 * Copyright (C) 2010-2025 Oryx Embedded SARL. All rights reserved.
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * as published by the Free Software Foundation; either version 2
 * of the License, or (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software Foundation,
 * Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301, USA.
 *
 * @author Oryx Embedded SARL (www.oryx-embedded.com)
 * @version 2.5.4
 **/

// Dependencies
#include <stdlib.h>
#include <string.h>
#include "core/net.h"
#include "debug.h"
#include "dhcp/dhcp_client.h"
#include "drivers/mac/stm32f7xx_eth_driver.h"
#include "drivers/phy/lan8742_driver.h"
#include "hardware/stm32f7xx/stm32f7xx_crypto.h"
#include "ipv6/slaac.h"
#include "rng/hmac_drbg.h"
#include "rng/trng.h"
#include "rsx.h"
#include "stm32f7xx.h"
#include "stm32f7xx_hal.h"
#include "stm32f7xx_nucleo_144.h"
#include "web_socket/web_socket.h"
#include "BMSlib.h"
#include "ads1015_temp.h"

// Ethernet interface configuration
#define APP_IF_NAME "eth0"
#define APP_HOST_NAME "test"
#define APP_MAC_ADDR "02-00-00-00-00-01"

#define APP_USE_DHCP_CLIENT DISABLED
#define APP_IPV4_HOST_ADDR "192.168.0.20"
#define APP_IPV4_SUBNET_MASK "255.255.255.0"
#define APP_IPV4_DEFAULT_GATEWAY "192.168.0.254"
#define APP_IPV4_PRIMARY_DNS "8.8.8.8"
#define APP_IPV4_SECONDARY_DNS "8.8.8.4"

#define APP_USE_SLAAC DISABLED
#define APP_IPV6_LINK_LOCAL_ADDR "fe80::767"
#define APP_IPV6_PREFIX "2001:db8::"
#define APP_IPV6_PREFIX_LENGTH 64
#define APP_IPV6_GLOBAL_ADDR "2001:db8::767"
#define APP_IPV6_ROUTER "fe80::1"
#define APP_IPV6_PRIMARY_DNS "2001:4860:4860::8888"
#define APP_IPV6_SECONDARY_DNS "2001:4860:4860::8844"

// Application configuration
#define APP_WS_SERVER_NAME "192.168.0.10"
#define APP_WS_SERVER_PORT 8080
#define APP_WS_SERVER_URI "/"

#define APP_SET_CIPHER_SUITES DISABLED
#define APP_SET_SERVER_NAME DISABLED
#define APP_SET_TRUSTED_CA_LIST DISABLED

// Global variables
OsEvent appEvent;
bool_t buttonEventFlag;
bool_t uvEventFlag;
bool_t measureVFlag;
bool_t measureIFlag;
bool_t measureBFlag;
bool_t printStatusFlag[18];
char printStatus[18][20] = {
		"motor on",
		"motor off",
		"arm on",
		"arm off",
		"5V on",
		"5V off",
		"12V on",
		"12V off",
		"24V on",
		"24V off",
		 "55V on",
		 "55V off",
		 "Red LED off",
		 "Red LED on",
		 "Green LED off",
		 "Green LED on",
		 "Blue LED off",
		 "Blue LED on"
};

DhcpClientSettings dhcpClientSettings;
DhcpClientContext dhcpClientContext;
SlaacSettings slaacSettings;
SlaacContext slaacContext;
HmacDrbgContext hmacDrbgContext;
uint8_t seed[48];
ADC_HandleTypeDef hadc1;
ADC_HandleTypeDef hadc3;
I2C_HandleTypeDef hi2c1;

TaskHandle_t  bmsUVProtectionHandle;
TaskHandle_t  ethernetHandle;
uint16_t batt_voltage_mv[NUMCELLS];
measure_t adc_measure;

WebSocket *webSocket;

/**
 * @brief System clock configuration
 **/



void SystemClock_Config(void) {
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  // Enable Power Control clock
  __HAL_RCC_PWR_CLK_ENABLE();

  // Enable HSE Oscillator and activate PLL with HSE as source
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_BYPASS;
  RCC_OscInitStruct.HSIState = RCC_HSI_OFF;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 8;
  RCC_OscInitStruct.PLL.PLLN = 432;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 9;
  HAL_RCC_OscConfig(&RCC_OscInitStruct);

  // Enable overdrive mode
  HAL_PWREx_EnableOverDrive();

  // Select PLL as system clock source and configure the HCLK, PCLK1 and PCLK2
  // clocks dividers
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK |
                                RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;
  HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_7);
}

/**
 * @brief MPU configuration
 **/

void MPU_Config(void) {
  MPU_Region_InitTypeDef MPU_InitStruct;

  // Disable MPU
  HAL_MPU_Disable();

  // SRAM2 (no cache)
  MPU_InitStruct.Enable = MPU_REGION_ENABLE;
  MPU_InitStruct.Number = MPU_REGION_NUMBER0;
  MPU_InitStruct.BaseAddress = 0x2007C000;
  MPU_InitStruct.Size = MPU_REGION_SIZE_16KB;
  MPU_InitStruct.SubRegionDisable = 0;
  MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL1;
  MPU_InitStruct.AccessPermission = MPU_REGION_FULL_ACCESS;
  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_DISABLE;
  MPU_InitStruct.IsShareable = MPU_ACCESS_SHAREABLE;
  MPU_InitStruct.IsCacheable = MPU_ACCESS_NOT_CACHEABLE;
  MPU_InitStruct.IsBufferable = MPU_ACCESS_NOT_BUFFERABLE;
  HAL_MPU_ConfigRegion(&MPU_InitStruct);

  // Enable MPU
  HAL_MPU_Enable(MPU_PRIVILEGED_DEFAULT);
}

/**
 * @brief Random data generation callback function
 * @param[out] data Buffer where to store the random data
 * @param[in] length Number of bytes that are required
 * @return Error code
 **/

error_t webSocketClientRngCallback(uint8_t *data, size_t length) {
  error_t error;

  // Generate some random data
  error = hmacDrbgGenerate(&hmacDrbgContext, data, length);
  // Return status code
  return error;
}

/**
 * @brief TLS initialization callback
 * @param[in] webSocket Handle referencing a WebSocket
 * @param[in] tlsContext Pointer to the TLS context
 * @return Error code
 **/

error_t webSocketClientTlsInitCallback(WebSocket *webSocket,
                                       TlsContext *tlsContext) {
  error_t error;

  // Debug message
  TRACE_INFO("WebSocket: TLS initialization callback\r\n");

  // Set the PRNG algorithm to be used
  error = tlsSetPrng(tlsContext, HMAC_DRBG_PRNG_ALGO, &hmacDrbgContext);
  // Any error to report?
  if (error) return error;

#if (APP_SET_CIPHER_SUITES == ENABLED)
  // Preferred cipher suite list
  error = tlsSetCipherSuites(tlsContext, cipherSuites, arraysize(cipherSuites));
  // Any error to report?
  if (error) return error;
#endif

#if (APP_SET_SERVER_NAME == ENABLED)
  // Set the fully qualified domain name of the server
  error = tlsSetServerName(tlsContext, APP_WS_SERVER_NAME);
  // Any error to report?
  if (error) return error;
#endif

#if (APP_SET_TRUSTED_CA_LIST == ENABLED)
  // Import the list of trusted CA certificates
  error = tlsSetTrustedCaList(tlsContext, trustedCaList, strlen(trustedCaList));
  // Any error to report?
  if (error) return error;
#endif

  // Successful processing
  return NO_ERROR;
}

/**
 * @brief WebSocket client test routine
 * @return Error code
 **/

error_t webSocketClientTest(void) {
  error_t error;
  size_t length;
  systime_t timestamp;
  systime_t currentTime;
  WebSocketFrameType type;
  IpAddr serverIpAddr;
  SocketEventDesc eventDesc[1];
  char_t buffer[256];
  int cmd_received;

  // Debug message
  TRACE_INFO("\r\n\r\nWebSocket: Resolving server name...\r\n");

  // Resolve server name
  error = getHostByName(NULL, APP_WS_SERVER_NAME, &serverIpAddr, 0);

