rsx-electrical/STM32-ethernet/rsx_ethernet/demo/st/nucleo_f767zi/web_socket_client_demo/src/main.c
  // Any error to report?
  if (error) {
    // Debug message
    TRACE_INFO("WebSocket: Failed to resolve server name!\r\n");
    // Exit immediately
    return error;
  }

  // Open a new WebSocket
  webSocket = webSocketOpen();
  // Failed to open WebSocket?
  if (webSocket == NULL) return ERROR_OPEN_FAILED;

  // Start of exception handling block
  do {
    // Set timeout value for blocking operations
    error = webSocketSetTimeout(webSocket, 30000);
    // Any error to report?
    if (error) break;

    // Set the hostname of the remote server
    error = webSocketSetHost(webSocket, APP_WS_SERVER_NAME);
    // Any error to report?
    if (error) break;

#if (APP_WS_SERVER_PORT == 443)
    // Register TLS initialization callback
    error = webSocketRegisterTlsInitCallback(webSocket,
                                             webSocketClientTlsInitCallback);
    // Any error to report?
    if (error) return error;
#endif

    // Debug message
    TRACE_INFO("\r\nWebSocket: Connecting to server...\r\n");

    // Establish the WebSocket connection
    error = webSocketConnect(webSocket, &serverIpAddr, APP_WS_SERVER_PORT,
                             APP_WS_SERVER_URI);
    // Any error to report?
    if (error) break;

    // Debug message
    TRACE_INFO("WebSocket: Connected to server\r\n");

    // Format message
    length = sprintf(buffer, "Hello World!");

    // Debug message
    TRACE_INFO("WebSocket: Sending message (%" PRIuSIZE " bytes)...\r\n",
               length);
    TRACE_INFO("  %s\r\n", buffer);

    // Save current time
    timestamp = osGetSystemTime();

    // Process events
    while (1) {
      // Set the events the application is interested in
      eventDesc[0].socket = webSocket->socket;
      eventDesc[0].eventMask = SOCKET_EVENT_RX_READY;

      // Check whether application data are pending in the receive buffer
      if (webSocketIsRxReady(webSocket)) {
        // No need to poll the underlying socket for incoming traffic...
        eventDesc[0].eventFlags = SOCKET_EVENT_RX_READY;
        error = NO_ERROR;
      } else {
        // Wait for incoming traffic from the remote host. A non-infinite
        // timeout is provided to manage the idle timeout (60s). refer to the
        // end of the loop
        error = socketPoll(eventDesc, arraysize(eventDesc), &appEvent, 1000);
      }

      // Check status code
      if (error == NO_ERROR || error == ERROR_WAIT_CANCELED) {
        if (eventDesc[0].eventFlags & SOCKET_EVENT_RX_READY) {
          // Receive data from the remote WebSocket server
          error = webSocketReceive(webSocket, buffer, sizeof(buffer) - 1, &type, &length);
          // Any error to report?
          if (error) {
        	  TRACE_INFO("weSocketReceive failed \n");
        	  break;
          }

          // Check the type of received data
          if (type == WS_FRAME_TYPE_TEXT || type == WS_FRAME_TYPE_BINARY) {
            // Properly terminate the string with a NULL character
            buffer[length] = '\0';

            // Debug message
            TRACE_INFO("WebSocket: Message received (%" PRIuSIZE
                       " bytes)...\r\n",
                       length);
            TRACE_INFO("received: \"%s\"\r\n", buffer);
            //parse buffer for command and set events
            if (parse_int(buffer, &cmd_received)) {
            	TRACE_INFO("failed parsing cmd");
            }

          } else if (type == WS_FRAME_TYPE_PING) {
            // Debug message
            TRACE_INFO("WebSocket: Ping message received (%" PRIuSIZE
                       " bytes)...\r\n",
                       length);
            // Debug message
            TRACE_INFO("WebSocket: Sending pong message (%" PRIuSIZE
                       " bytes)...\r\n",
                       length);

            // Send a Pong frame in response
            error = webSocketSend(webSocket, buffer, length, WS_FRAME_TYPE_PONG,
                                  NULL);
            // Any error to report?
            if (error) break;
          }

          // Save current time
          timestamp = osGetSystemTime();
        }
      }

       // Check user  state
       if (buttonEventFlag) {
         // Clear flag
         buttonEventFlag = FALSE;

         // Format event message
         length = sprintf(buffer, "User button pressed!");
		TRACE_INFO("buttonEventFlag set, sending  %s\r\n", buffer);

         // Debug message
         TRACE_INFO("WebSocket: Sending message (%" PRIuSIZE " bytes)...\r\n",
                    length);
         TRACE_INFO("  %s\r\n", buffer);

         // Send a message to the WebSocket server
         error =
             webSocketSend(webSocket, buffer, length, WS_FRAME_TYPE_TEXT,
             NULL);
         // Any error to report?
         if (error) break;

         // Save current time
         timestamp = osGetSystemTime();
       }

       if (uvEventFlag){
           // Clear flag
    	   uvEventFlag = FALSE;
           // Format event message
    	   length = sprintf(buffer, "%4d,%4d,%4d,%4d", batt_voltage_mv[0], batt_voltage_mv[1], batt_voltage_mv[2], batt_voltage_mv[3]);
    	   TRACE_INFO("sending  %s\r\n", buffer);
           // Send a message to the WebSocket server
           error =
               webSocketSend(webSocket, buffer, length, WS_FRAME_TYPE_TEXT,
               NULL);
           // Any error to report?
           if (error) break;
           // Save current time
           timestamp = osGetSystemTime();
       }
       if (measureVFlag){
           // Clear flag
    	   measureVFlag = FALSE;
           // Format event message
    	   length = sprintf(buffer, "%4d,%4d,%4d,%4d", adc_measure.mv_12v, adc_measure.mv_24v, adc_measure.mv_55v, adc_measure.mv_batt_adc);
    	   TRACE_INFO("measureVFlag set, sending voltages: %s\r\n", buffer);
           // Send a message to the WebSocket server
           error =
               webSocketSend(webSocket, buffer, length, WS_FRAME_TYPE_TEXT,
               NULL);
           // Any error to report?
           if (error) break;
           // Save current time
           timestamp = osGetSystemTime();
       }
       if (measureBFlag){
           // Clear flag
    	   measureBFlag = FALSE;
           // Format event message
    	   length = sprintf(buffer, "%4d,%4d,%4d,%4d,%4d,%4d",
    			   batt_voltage_mv[0], batt_voltage_mv[1], batt_voltage_mv[2], batt_voltage_mv[3],
				   adc_measure.mv_batt_adc, adc_measure.mv_batt_bms);
    	   TRACE_INFO("measureBFlag set, sending battery voltages: %s\r\n", buffer);
           // Send a message to the WebSocket server
           error =
               webSocketSend(webSocket, buffer, length, WS_FRAME_TYPE_TEXT,
               NULL);
           // Any error to report?
           if (error) break;
           // Save current time
           timestamp = osGetSystemTime();
       }
       if (measureIFlag){
           // Clear flag
    	   measureIFlag = FALSE;
           // Format event message
    	   length = sprintf(buffer, "%.2f,%.2f,%.2f", adc_measure.a_arm_motor, adc_measure.a_charger, adc_measure.a_batt);
    	   TRACE_INFO("measureIFlag set, sending currents: %s\r\n", buffer);
           // Send a message to the WebSocket server
           error =
               webSocketSend(webSocket, buffer, length, WS_FRAME_TYPE_TEXT,
               NULL);
           // Any error to report?
           if (error) break;
           // Save current time
           timestamp = osGetSystemTime();
       }
       if (is_all_zero(printStatusFlag, sizeof(printStatusFlag))){
     	   for (size_t i = 0; i < sizeof(printStatusFlag); i++) {
     		    if (printStatusFlag[i]){
     		    	length = sprintf(buffer, "Received, %s", printStatus[i]);
     		    	TRACE_INFO("printStatusFlag set, sending: %s\r\n", buffer);
					 // Send a message to the WebSocket server
					 error = webSocketSend(webSocket, buffer, length, WS_FRAME_TYPE_TEXT, NULL);
			         if (error) break;
			         printStatusFlag[i] = 0;
     		    }
 				timestamp = osGetSystemTime();
     	   }
       }
      // Get current time
      currentTime = osGetSystemTime();

      // Manage idle timeout (if applicable)
      if (timeCompare(currentTime, timestamp + 60000) >= 0) {
        // Close WebSocket connection
        error = NO_ERROR;
        break;
      }
    }

    // Properly close the WebSocket connection
    webSocketShutdown(webSocket);

    // End of exception handling block
  } while (0);

