rsx-electrical/STM32-ethernet/rsx_ethernet/demo/st/nucleo_f767zi/web_socket_client_demo/src/main.c
  // Release the WebSocket
  webSocketClose(webSocket);

  // Return error code
  return error;
}

/**
 * @brief websocketTask, creates the websocket upon reset
 * @param[in] param Unused parameter
 **/

void websocketTask(void *param) {
  // Endless loop
  while (1) {
    // Main websocket routine
    webSocketClientTest();
  }
}

/**
 * @brief Button task
 **/

void buttonTask(void *param) {
  bool_t state = FALSE;
  bool_t prevState = FALSE;

  // Endless loop
  while (1) {
    // Retrieve user button state
    state = BSP_PB_GetState(BUTTON_KEY);

    // User button pressed?
    if (state && !prevState) {
      // Notify the WebSocket task of the event
      buttonEventFlag = TRUE;
      osSetEvent(&appEvent);
    }

    // Save current state
    prevState = state;

    // Loop delay
    osDelayTask(100);
  }
}

/**
 * @brief LED task
 * @param[in] param Unused parameter
 **/

void ledTask(void *param) {
  // Endless loop
  while (1) {
    BSP_LED_On(LED1);
    osDelayTask(100);
    BSP_LED_Off(LED1);
    osDelayTask(900);
  }
}


#define STATE_IDLE 0
#define ENABLE_5 1
#define ENABLE_12 2
#define ENABLE_19 3
#define ENABLE_24 4
#define ENABLE_55 5
#define ENABLE_ARM 6
#define ENABLE_MOTOR 7

int_t main(void) {
  error_t error;
  OsTaskId taskId;
  OsTaskParameters taskParams;
  NetInterface *interface;
  MacAddr macAddr;
#if (APP_USE_DHCP_CLIENT == DISABLED)
  Ipv4Addr ipv4Addr;
#endif
#if (APP_USE_SLAAC == DISABLED)
  Ipv6Addr ipv6Addr;
#endif

  // MPU configuration
  MPU_Config();
  // HAL library initialization
  HAL_Init();
  // Configure the system clock
  SystemClock_Config();

  // Enable I-cache and D-cache
  SCB_EnableICache();
  SCB_EnableDCache();

  // Initialize kernel
  osInitKernel();
  // Configure debug UART
  debugInit(115200);
  RSX_GPIO_Init();
  RSX_SPI_Init();

  // Start-up message
  TRACE_INFO("\r\n");
  TRACE_INFO("****************************************\r\n");
  TRACE_INFO("*** CycloneTCP WebSocket Client Demo ***\r\n");
  TRACE_INFO("****************************************\r\n");
  TRACE_INFO("Copyright: 2010-2025 Oryx Embedded SARL\r\n");
  TRACE_INFO("Compiled: %s %s\r\n", __DATE__, __TIME__);
  TRACE_INFO("Target: STM32F767\r\n");
  TRACE_INFO("\r\n");

  // LED configuration
  BSP_LED_Init(LED1);
  BSP_LED_Init(LED2);
  BSP_LED_Init(LED3);

  // Clear LEDs
  BSP_LED_Off(LED1);
  BSP_LED_Off(LED2);
  BSP_LED_Off(LED3);

  // Initialize user button
  BSP_PB_Init(BUTTON_KEY, BUTTON_MODE_GPIO);

  // Initialize hardware cryptographic accelerator
  error = stm32f7xxCryptoInit();
  // Any error to report?
  if (error) {
    // Debug message
    TRACE_ERROR("Failed to initialize hardware crypto accelerator!\r\n");
  }

  // Generate a random seed
  error = trngGetRandomData(seed, sizeof(seed));
  // Any error to report?
  if (error) {
    // Debug message
    TRACE_ERROR("Failed to generate random data!\r\n");
  }

  // PRNG initialization
  error = hmacDrbgInit(&hmacDrbgContext, SHA256_HASH_ALGO);
  // Any error to report?
  if (error) {
    // Debug message
    TRACE_ERROR("Failed to initialize PRNG!\r\n");
  }

  // Properly seed the PRNG
  error = hmacDrbgSeed(&hmacDrbgContext, seed, sizeof(seed));
  // Any error to report?
  if (error) {
    // Debug message
    TRACE_ERROR("Failed to seed PRNG!\r\n");
  }

  // TCP/IP stack initialization
  error = netInit();
  // Any error to report?
  if (error) {
    // Debug message
    TRACE_ERROR("Failed to initialize TCP/IP stack!\r\n");
  }

  // Configure the first Ethernet interface
  interface = &netInterface[0];

  // Set interface name
  netSetInterfaceName(interface, APP_IF_NAME);
  // Set host name
  netSetHostname(interface, APP_HOST_NAME);
  // Set host MAC address
  macStringToAddr(APP_MAC_ADDR, &macAddr);
  netSetMacAddr(interface, &macAddr);
  // Select the relevant network adapter
  netSetDriver(interface, &stm32f7xxEthDriver);
  netSetPhyDriver(interface, &lan8742PhyDriver);

  // Initialize network interface
  error = netConfigInterface(interface);
  // Any error to report?
  if (error) {
    // Debug message
    TRACE_ERROR("Failed to configure interface %s!\r\n", interface->name);
  }

#if (IPV4_SUPPORT == ENABLED)
#if (APP_USE_DHCP_CLIENT == ENABLED)
  // Get default settings
  dhcpClientGetDefaultSettings(&dhcpClientSettings);
  // Set the network interface to be configured by DHCP
  dhcpClientSettings.interface = interface;
  // Disable rapid commit option
  dhcpClientSettings.rapidCommit = FALSE;

  // DHCP client initialization
  error = dhcpClientInit(&dhcpClientContext, &dhcpClientSettings);
  // Failed to initialize DHCP client?
  if (error) {
    // Debug message
    TRACE_ERROR("Failed to initialize DHCP client!\r\n");
  }

  // Start DHCP client
  error = dhcpClientStart(&dhcpClientContext);
  // Failed to start DHCP client?
  if (error) {
    // Debug message
    TRACE_ERROR("Failed to start DHCP client!\r\n");
  }
#else
  // Set IPv4 host address
  ipv4StringToAddr(APP_IPV4_HOST_ADDR, &ipv4Addr);
  ipv4SetHostAddr(interface, ipv4Addr);

  // Set subnet mask
  ipv4StringToAddr(APP_IPV4_SUBNET_MASK, &ipv4Addr);
  ipv4SetSubnetMask(interface, ipv4Addr);

  // Set default gateway
  ipv4StringToAddr(APP_IPV4_DEFAULT_GATEWAY, &ipv4Addr);
  ipv4SetDefaultGateway(interface, ipv4Addr);

  // Set primary and secondary DNS servers
  ipv4StringToAddr(APP_IPV4_PRIMARY_DNS, &ipv4Addr);
  ipv4SetDnsServer(interface, 0, ipv4Addr);
  ipv4StringToAddr(APP_IPV4_SECONDARY_DNS, &ipv4Addr);
  ipv4SetDnsServer(interface, 1, ipv4Addr);
#endif
#endif

#if (IPV6_SUPPORT == ENABLED)
#if (APP_USE_SLAAC == ENABLED)
  // Get default settings
  slaacGetDefaultSettings(&slaacSettings);
  // Set the network interface to be configured
  slaacSettings.interface = interface;

  // SLAAC initialization
  error = slaacInit(&slaacContext, &slaacSettings);
  // Failed to initialize SLAAC?
  if (error) {
    // Debug message
    TRACE_ERROR("Failed to initialize SLAAC!\r\n");
  }

  // Start IPv6 address autoconfiguration process
  error = slaacStart(&slaacContext);
  // Failed to start SLAAC process?
  if (error) {
    // Debug message
    TRACE_ERROR("Failed to start SLAAC!\r\n");
  }
#else
  // Set link-local address
  ipv6StringToAddr(APP_IPV6_LINK_LOCAL_ADDR, &ipv6Addr);
  ipv6SetLinkLocalAddr(interface, &ipv6Addr);

