rsx-electrical/STM32-ethernet/rsx_ethernet/demo/st/nucleo_f767zi/web_socket_client_demo/src/main.c
  // Set IPv6 prefix
  ipv6StringToAddr(APP_IPV6_PREFIX, &ipv6Addr);
  ipv6SetPrefix(interface, 0, &ipv6Addr, APP_IPV6_PREFIX_LENGTH);

  // Set global address
  ipv6StringToAddr(APP_IPV6_GLOBAL_ADDR, &ipv6Addr);
  ipv6SetGlobalAddr(interface, 0, &ipv6Addr);

  // Set default router
  ipv6StringToAddr(APP_IPV6_ROUTER, &ipv6Addr);
  ipv6SetDefaultRouter(interface, 0, &ipv6Addr);

  // Set primary and secondary DNS servers
  ipv6StringToAddr(APP_IPV6_PRIMARY_DNS, &ipv6Addr);
  ipv6SetDnsServer(interface, 0, &ipv6Addr);
  ipv6StringToAddr(APP_IPV6_SECONDARY_DNS, &ipv6Addr);
  ipv6SetDnsServer(interface, 1, &ipv6Addr);
#endif
#endif

  // Register RNG callback
  webSocketRegisterRandCallback(webSocketClientRngCallback);

  // Create an event object
  if (!osCreateEvent(&appEvent)) {
    // Debug message
    TRACE_ERROR("Failed to create event!\r\n");
  }

  // Set task parameters
  taskParams = OS_TASK_DEFAULT_PARAMS;
  taskParams.stackSize = 500;
  taskParams.priority = OS_TASK_PRIORITY_NORMAL;

  // Create ethernet task
  ethernetHandle = osCreateTask("User", websocketTask, NULL, &taskParams);
  // Failed to create the task?
  if (ethernetHandle == NULL) {
    // Debug message
    TRACE_ERROR("Failed to create task!\r\n");
  }

  // Set task parameters
  taskParams = OS_TASK_DEFAULT_PARAMS;
  taskParams.stackSize = 500;
  taskParams.priority = OS_TASK_PRIORITY_NORMAL;

  // Create a task to manage button events
  taskId = osCreateTask("Button", buttonTask, NULL, &taskParams);
  // Failed to create the task?
  if (taskId == OS_INVALID_TASK_ID) {
    // Debug message
    TRACE_ERROR("Failed to create task!\r\n");
  }

  // Set task parameters
  taskParams = OS_TASK_DEFAULT_PARAMS;
  taskParams.stackSize = 200;
  taskParams.priority = OS_TASK_PRIORITY_NORMAL;

  // Create a task to blink the LED
  taskId = osCreateTask("LED", ledTask, NULL, &taskParams);
  // Failed to create the task?
  if (taskId == OS_INVALID_TASK_ID) {
    // Debug message
    TRACE_ERROR("Failed to create task!\r\n");
  }

  rsx_task_handle = osCreateTask("rsx", rsxTask, NULL, &taskParams);
  if (rsx_task_handle == NULL) {
    // Debug message
    TRACE_ERROR("Failed to create task!\r\n");
  }


  spiSendTaskHandle = osCreateTask("spi_send", rsxSpiSendTask, NULL, &taskParams);
  if (spiSendTaskHandle == NULL) {
    // Debug message
    TRACE_ERROR("Failed to create task!\r\n");
  }

#ifndef DISABLE_UV_PROTECTION
  bmsUVProtectionHandle = osCreateTask("bms_uv_protection", bmsUVProtectionTask, NULL, &taskParams);
  if (bmsUVProtectionHandle == NULL) {
    // Debug message
    TRACE_ERROR("Failed to create task!\r\n");
  }
#endif
  // Create temperature sensor task
   //ads1015TempTaskCreate();   // <--- ADD THIS LINE

   // Start the execution of tasks
   osStartKernel();

  // This function should never return
  return 0;
}
